?- mascot(who,tsecgames).
false.

?- mascot(tibu,tsecgames).
true.

?- mascot(x,tsecgames).
false.

?- mascot(Who,tsecgames).
Who = tibu.

?- vertebrate(X).
X = tibu .

?- eat(tibu,X).
X = leaves.

?- eat(tibu,Food).
Food = leaves.

volume :
?- area(5).
the surface area of the cube is 150
the volume of the cube is: 125
